Repository: LukaszKluza/Foodini
Catalog: frontend/lib/l10n/app_*.arb
Languages: pl

source: Hey
pl: Hej

source: My Account
pl: Moje konto

source: Change password
pl: Zmień hasło

source: Change language
pl: Zmień język

source: Delete account
pl: Usuń konto

source: Home
pl: Strona główna

source: Welcome
pl: Witamy

# requiredName
source: Name is required
pl: Imię jest wymagane

# requiredLastname
source: Lastname is required
pl: Nazwisko jest wymagane

source: Provide correct name
pl: Podaj poprawne imię

source: Provide correct lastname
pl: Podaj poprawne nazwisko

# requiredCountry
source: Select your country
pl: Wybierz kraj

# requiredEmail
source: E-mail is required
pl: E-mail jest wymagany

# requiredPassword
source: Password is required
pl: Hasło jest wymagane

# requiredPasswordConfirmation
source: Password confirmation is required
pl: Potwierdzenie hasła jest wymagane

# samePasswords
source: Passwords must be the same
pl: Hasła muszą być takie same

source: Password length must be between
pl: Długość hasła musi być pomiędzy

# passwordComplexityError
source: Password must contain letters (capital and lowercase) and numbers
pl: Hasło musi zawierać wielkie i małe litery oraz cyfry

# invalidEmail
source: Enter valid e-mail
pl: Podaj poprawny adres e-mail

source: Registration
pl: Rejestracja

source: Register
pl: Zarejestruj

source: Your
pl: Twoje

source: Account
pl: Konto

# alreadyHaveAnAccount
source: Already have an account? Login
pl: Masz już konto? Zaloguj się

source: First name
pl: Imię

source: Last name
pl: Nazwisko

source: Country
pl: Kraj

source: Password
pl: Hasło

source: Confirm password
pl: Potwierdź hasło

source: New password
pl: Nowe hasło

source: Login
pl: Zaloguj się

# dontHaveAccount
source: Do not have an account
pl: Nie masz konta

# forgotPassword
source: Forgot my password
pl: Nie pamiętam hasła

source: Successfully logged in
pl: Zalogowano pomyślnie

# successfullyLoggedOut
source: Account logged out successfully
pl: Pomyślnie wylogowano

# successfullyDeletedAccount
source: Account deleted successfully
pl: Konto usunięte pomyślnie

# accountActivatedSuccessfully
source: Account has been activated successfully
pl: Konto zostało aktywowane

# accountHasNotBeenConfirmed
source: Your account has not been confirmed.
pl: Twoje konto nie zostało aktywowane.

# successfullyResendEmailVerification
source: Email account verification send successfully
pl: E-mail weryfikacyjny wysłano pomyślnie

source: Send verification email again
pl: Wyślij e-mail weryfikacyjny ponownie

# accountDeletionInformation
source: Are you sure you want to delete your account? This action cannot be undone.
pl: Czy na pewno chcesz usunąć konto? Tej operacji nie można cofnąć.

source: Confirm Account Deletion
pl: Potwierdź usunięcie konta

source: Delete
pl: Usuń

source: Cancel
pl: Anuluj

source: Login failed
pl: Logowanie nie powiodło się

source: Logout
pl: Wyloguj

source: Something went wrong
pl: Coś poszło nie tak

source: Unknown error
pl: Nieznany błąd

# checkAndConfirmEmailAddress
source: Check and confirm your email address
pl: Sprawdź i potwierdź adres e-mail

# checkEmailAddressToSetNewPassword
source: Check your email address to set new password
pl: Sprawdź e-mail, aby ustawić nowe hasło

source: Password successfully changed
pl: Hasło zostało zmienione

# wrongChangePasswordUrl
source: You can't access change password form
pl: Nie możesz otworzyć formularza zmiany hasła

source: Diet preferences
pl: Preferencje dietetyczne

source: Diet type
pl: Typ diety

# requiredDietType
source: Diet type is required
pl: Typ diety jest wymagany

source: Diet style
pl: Styl diety

source: Allergies
pl: Alergie

source: Diet goal
pl: Cel diety

source: Enter your diet goal
pl: Wprowadź swój cel diety

source: Weight (kg)
pl: Waga (kg)

source: Weight (g)
pl: Waga (g)

source: Diet goal should be between
pl: Cel diety powinien być pomiędzy

# muscleGainGoalCantBeLower
source: Diet goal for 'Muscle Gain' can't be lower than current weight
pl: Cel diety dla 'Przyrostu masy mięśniowej' nie może być mniejszy niż obecna waga

# fatLossGoalCantBeHigher
source: Diet goal for 'Fat Loss' cant't be higher than current weight
pl: Cel diety dla 'Utraty tłuszczu' nie może być większy niż obecna waga

source: Meals per day
pl: Liczba posiłków dziennie

source: Diet intensity
pl: Intensywność diety

# requiredDietIntensity
source: Diet intensity is required
pl: Wybierz intensywność diety

source: Daily budget
pl: Dzienny budżet

# requiredDailyBudget
source: Daily budget is required
pl: Dzienny budżet jest wymagany

source: Cooking skills
pl: Umiejętności kulinarne

# requiredCookingSkills
source: Cooking skills are required
pl: Umiejętności kulinarne są wymagane

source: Calories prediction
pl: Prognoza zapotrzebowania kalorycznego

source: Activity level
pl: Poziom aktywności

# requiredActivityLevel
source: Activity level is required
pl: Wskaż poziom swojej aktywności

source: Stress level
pl: Poziom stresu

# requiredStressLevel
source: Stress level is required
pl: Wskaż poziom stresu

source: Sleep quality
pl: Jakość snu

# requiredSleepQuality
source: Sleep quality is required
pl: Wskaż jakość snu

# advancedBodyParameters
source: Advance body parameters
pl: Zaawansowane parametry ciała

source: Muscle percentage
pl: Procent mięśni

# enterMusclePercentage
source: Enter your muscle %
pl: Procent mięśni

# musclePercentageShouldBeBetween
source: Muscle % should be between
pl: Procent mięśni powinien być pomiędzy

source: Water percentage
pl: Procent wody

# enterWaterPercentage
source: Enter your water percentage
pl: Wprowadź procent wody

# waterPercentageShouldBeBetween
source: Water % should be %
pl: Procent wody powinien być pomiędzy

source: Fat percentage
pl: Procent tłuszczu

# enterFatPercentage
source: Enter your fat percentage
pl: Wprowadź procent tłuszczu

# fatPercentageShouldBeBetween
source: Fat % should be %
pl: Procent tłuszczu powinien być pomiędzy

# advancedParametersValidation
source: Sum of advanced parameters can't be higher than
pl: Suma zaawansowanych parametrów nie może być wyższa niż

source: Generate weekly diet
pl: Wygeneruj tygodniową dietę

source: Predicted calories
pl: Przewidywana liczba kalorii

# bmr
source: Basal Metabolic Rate (BMR)
pl: Podstawowa przemiana materii (BMR)

# tdee
source: Total Daily Energy Expenditure (TDEE)
pl: Całkowite dzienne zapotrzebowanie (TDEE)

# predictedMacros
source: Predicted macronutrients
pl: Przewidywane makroskładniki

source: Diet duration
pl: Czas trwania diety

# dietType_FatLoss
source: Fat Loss
pl: Utrata tłuszczu

# dietType_MuscleGain
source: Muscle Gain
pl: Przyrost masy mięśniowej

# dietType_WeightMaintenance
source: Weight Maintenance
pl: Utrzymanie wagi

# allergies_Peanuts
source: Peanuts
pl: Orzeszki ziemne

# allergies_Lactose
source: Lactose
pl: Laktoza

# allergies_Fish
source: Fish
pl: Ryby

# allergies_Soy
source: Soy
pl: Soja

# allergies_Wheat
source: Wheat
pl: Pszenica

# allergies_Celery
source: Celery
pl: Seler

# allergies_Sulphites
source: Sulphites
pl: Siarczyny

# allergies_Lupin
source: Lupin
pl: Łubin

# dietStyle_Vegetarian
source: Vegetarian
pl: Wegetariańska

# dietStyle_Vegan
source: Vegan
pl: Wegańska

# dailyBudget_low
source: Low
pl: Niski

# dailyBudget_medium
source: Medium
pl: Średni

# dailyBudget_high
source: High
pl: Wysoki

# cookingSkills_beginner
source: Beginner
pl: Początkujący

# cookingSkills_advanced
source: Advanced
pl: Zaawansowany

# cookingSkills_professional
source: Professional
pl: Profesjonalista

# dietIntensity_Slow
source: Slow
pl: Powolna

# dietIntensity_Medium
source: Medium
pl: Średnia

# dietIntensity_Fast
source: Fast
pl: Szybka

# activityLevel_VeryLow
source: Very Low (1–2 days a week or less)
pl: Bardzo niska (1–2 dni w tygodniu lub mniej)

# activityLevel_Light
source: Low (2–3 days a week)
pl: Niska (2–3 dni w tygodniu)

# activityLevel_Moderate
source: Moderate (3–4 days a week)
pl: Umiarkowana (3–4 dni w tygodniu)

# activityLevel_Active
source: Active (5–6 days a week)
pl: Aktywna (5–6 dni w tygodniu)

# activityLevel_VeryActive
source: Very Active (daily activity)
pl: Bardzo aktywna (codzienna aktywność)

# stressLevel_Low
source: Low
pl: Niski

# stressLevel_Medium
source: Medium
pl: Średni

# stressLevel_High
source: High
pl: Wysoki

# stressLevel_Extreme
source: Extreme
pl: Ekstremalny

# sleepQuality_Poor
source: Poor
pl: Słaba

# sleepQuality_Fair
source: Fair
pl: Średnia

# sleepQuality_Good
source: Good
pl: Dobra

# sleepQuality_Excellent
source: Excellent
pl: Świetna

source: Profile Details
pl: Szczegóły profilu

source: Gender
pl: Płeć

# requiredGender
source: Gender is required
pl: Płeć jest wymagana

# gender_Male
source: Male
pl: Mężczyzna

# gender_Female
source: Female
pl: Kobieta

source: Height
pl: Wzrost

source: Enter your height
pl: Wprowadź swój wzrost

source: Height (cm)
pl: Wzrost (cm)

source: Height should be between
pl: Wzrost powinien być pomiędzy

source: Weight
pl: Waga

source: Enter your weight
pl: Wprowadź swoją wagę

source: Weight should be between
pl: Waga powinna być pomiędzy

source: Date of birth
pl: Data urodzenia

# enterDateOfBirth
source: Enter your date of birth
pl: Wprowadź swoją datę urodzenia

source: Form successfully submitted
pl: Formularz został pomyślnie wysłany

source: Fill all necessary fields
pl: Wypełnij wszystkie wymagane pola

source: Macros
pl: Makro

source: days
pl: dni

source: expected
pl: oczekiwane

source: Protein (g)
pl: Białko (g)

source: Fat (g)
pl: Tłuszcz (g)

source: Carbs (g)
pl: Węgle (g)

# fillFormToSeePredictions
source: Please fill out the form to see predictions
pl: Proszę wypełnić formularz, aby zobaczyć predykcje

source: Redirect to profile details
pl: Przejdź do szczegółów profilu

source: Save predicted calories
pl: Zapisz wygenerowane kalorie

source: Change calories prediction
pl: Zmień przewidywane kalorie

source: Refresh request
pl: Odśwież żądanie

source: Go to main page
pl: Idź na stronę główną

source: Error while fetching meal icon
pl: Błąd podczas pobierania ikony posiłku

# mealDescriptions
source: Meal description
pl: Opis posiłku

source: Groceries
pl: Produkty spożywcze

source: Recipe
pl: Przepis

source: Optional
pl: Opcjonalnie

source: Breakfast
pl: Śniadanie

source: Morning snack
pl: Drugie śniadanie

source: Lunch
pl: Obiad

source: Afternoon snack
pl: Podwieczorek

source: Dinner
pl: Kolacja

source: Evening snack
pl: Przekąska wieczorna

source: To eat
pl: Do zjedzenia

source: Pending
pl: Oczekujący

source: Eaten
pl: Zjedzony

source: Skipped
pl: Pominięty

# f_fat
source: F
pl: T

# p_protein
source: P
pl: B

# c_carbs
source: C
pl: W

# cal_calories
source: Cal
pl: Kal

# of_calories
source: of
pl: z

source: Cannot edit past meals
pl: Nie można edytować posiłków z przeszłości

# noMealsForToday
source: There aren't any meals planned for today
pl: Nie masz zaplanowanych żadnych posiłków na dziś

source: marked as
pl: oznaczone jako

source: Daily Summary
pl: Dzienne podsumowanie

# fillFormToGenerateMeals
source: Please fill out the form to be able to generate meals
pl: Proszę wypełnić formularz, aby móc generować posiłki

# dailyMeals
source: Daily Menu
pl: Dzienne menu

source: Planned meals for
pl: Planowane posiłki na

source: Macros summary
pl: Podsumowanie makroskładników

source: Calories
pl: Kalorie

source: Submit
pl: Zatwierdź

source: Edit
pl: Edytuj

source: Skip Meal
pl: Pomiń posiłek

source: Add new meal
pl: Dodaj nowy posiłek

source: Save
pl: Zapisz

# confirmRemovingMeal
source: Confirm you want to remove that meal
pl: Potwierdź, że chcesz usunąć ten posiłek

source: Scan product bar code
pl: Zeskanuj kod kreskowy produktu

# productBarCode
source: Bar code
pl: Kod kreskowy

source: Add product
pl: Dodaj produkt

source: Upload barcode image
pl: Dodaj zdjęcie kodu kreskowego

source: Read file:
pl: Wczytano plik:

source: Barcode cannot be empty
pl: Kod kreskowy nie może być pusty

# barcodeMustBeLength
source: Barcode must be exactly
pl: Kod kreskowy musi mieć długość

source: Barcode must contain only digits
pl: Kod kreskowy może zawierać tylko cyfry

source: Barcode uploaded
pl: Kod kreskowy dodany

source: Meal name
pl: Nazwa posiłku

source: Meal item name should be between
pl: Nazwa posiłku powinna mieć długość pomiędzy

source: Value of this macro should be between
pl: Wartość tego makroskładnika powinna mieścić się w przedziale

source: Value of calories should be between
pl: Wartość kalorii powinna mieścić się w przedziale

source: Value of weight should be between
pl: Wartość kalorii powinna mieścić się w przedziale

source: Generate New Plan
pl: Generuj posiłki

source: Regenerate Meals
pl: Generuj posiłki ponownie

# dietOutdatedConsiderRegenerating
source: Your meal plan may be outdated – consider regenerating it.
pl: Menu może być nieaktualne – rozważ regenerację.

# dietOutdated
source: Your meal plan may be outdated.
pl: Menu może być nieaktualne.

# planDoesNotExist
source: Plan for given day does not exist.
pl: Plan na dany dzień nie istnieje.

source: Choose option
pl: Wybierz opcję

source: Statistics
pl: Statystyki

# mealsGeneratedSuccessfully
source: Meals successfully generated
pl: Pomyślnie wygenerowano posiłki

# forSomething
source: for
pl: dla

# whileMealsGeneration
source: while generating meals
pl: podczas generowania posiłków

source: Error
pl: Błąd

source: Information
pl: Informacja

source: Your statistics
pl: Twoje statystyki

# statisticsLoadFailure
source: Failed to load statistics
pl: Nie udało się załadować statystyk

# statistsMissing
source: No statistics available
pl: Statystyki niedostępne

# calorieConsumptionChartTitle
source: Calorie consumption
pl: Spożyte kalorie

# calorieGoalChartTitle
source: Calorie Goal vs Actual
pl: Cel kalorii vs faktyczne spożycie
